print("+-------+---------------+-----------------+")
print("|   x   |      f(x)     | Количество (n)  |")
print("+-------+---------------+-----------------+")

for i in range(1, 10):
    # Вычисление вещественного значения x с шагом 0.1
    x = i / 10.0
    first = 1.0
    s = first

    # Первый член ряда
    term = -x / 2.0
    s += term

    n = 2

    # Бесконечный цикл для суммирования оставшихся членов ряда
    while True:
        term = term * ((2 * n - 3) * x) / (2 * n)
        s += term
        n += 1

        # Условие выхода: если по модулю член меньше заданной погрешности
        if abs(term) < 10 ** -10:
            break

    # Форматированный вывод строки таблицы
    print("| %5.1f | %13.10f | %15d |" % (x, s, n))

print("+-------+---------------+-----------------+")